tap "homebrew/bundle"
tap "homebrew/cask-fonts"

brew "fd" # telescope.nvim dependency
brew "fish"
brew "fisher"
brew "go"
brew "lazygit"
brew "luarocks"
brew "minikube"
brew "neovim"
brew "node@20"
brew "nodenv"
brew "pyenv"
brew "python-tk@3.12"
brew "python@3.12"
brew "rbenv"
brew "ripgrep" # telescope.nvim dependency
brew "starship"
brew "tree"
brew "wget"

cask "1password"
cask "arq"
cask "docker"
cask "firefox"
cask "fission"
cask "font-sf-mono"
cask "font-symbols-only-nerd-font"
cask "wezterm"
