tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "bash-language-server"
brew "clang-format"
brew "fd"
brew "fish"
brew "go"
brew "gopls"
brew "lua-language-server"
brew "marksman"
brew "minikube"
brew "neovim"
brew "node@20"
brew "nodenv"
brew "prettierd"
brew "pyenv"
brew "pyright"
brew "python@3.12"
brew "python-tk@3.12"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "ruff"
brew "ruff-lsp"
brew "shfmt"
brew "starship"
brew "stylua"
brew "taplo"
brew "tree"
brew "typescript-language-server"
brew "vscode-langservers-extracted"
brew "wget"
brew "yaml-language-server"
cask "1password"
cask "arq"
cask "docker"
cask "firefox"
cask "fission"
cask "font-sf-mono"
cask "font-symbols-only-nerd-font"
cask "wezterm"
