tap "homebrew/bundle"
tap "jandedobbeleer/oh-my-posh"
# tap "nikitabobko/tap"

brew "bash"
brew "bash-language-server"
brew "clang-format"
brew "fd"
brew "fish"
brew "go"
brew "gopls"
brew "lua-language-server"
brew "marksman"
brew "mas"
brew "minikube"
brew "neovim"
brew "node@20"
brew "nodenv"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "prettierd"
brew "pyenv"
brew "pyright"
brew "python@3.12"
brew "python-tk@3.12"
brew "rbenv"
brew "ripgrep"
brew "ruff"
brew "ruff-lsp"
brew "shfmt"
brew "stylua"
brew "taplo"
brew "tree"
brew "typescript-language-server"
brew "vscode-langservers-extracted"
brew "wget"
brew "yaml-language-server"

cask "1password"
# cask "nikitabobko/tap/aerospace"
cask "arq"
cask "docker"
cask "dropbox"
cask "fission"
cask "font-sf-mono"
cask "font-symbols-only-nerd-font"
cask "powerphotos"
cask "sf-symbols"
cask "wezterm"

mas "1Password for Safari", id: 1569813296
mas "Audiobook Builder", id: 1437681957
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Outread", id: 778846279
mas "Pages", id: 409201541
mas "Speedtest", id: 1153157709
mas "Xcode", id: 497799835
