tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Apps

cask "1password"
cask "arq"
cask "docker"
cask "firefox"
cask "fission"

# Programming Languages

brew "go"
brew "node@20"
brew "nodenv"
brew "pyenv"
brew "python-tk@3.12"
brew "python@3.12"
brew "rbenv"

# Terminal / Shell

brew "fd" # telescope.nvim dependency
brew "fish"
brew "fisher"
cask "font-sf-mono"
cask "font-symbols-only-nerd-font"
brew "lazygit"
brew "minikube"
brew "neovim"
brew "ripgrep" # telescope.nvim dependency
brew "starship"
brew "tree"
brew "wget"
cask "wezterm"

# VS Code

cask "visual-studio-code"
vscode "asvetliakov.vscode-neovim"
vscode "Catppuccin.catppuccin-vsc"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "huacnlee.theme-macos-classic"
vscode "JohnnyMorganz.stylua"
vscode "medo64.render-crlf"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
