# Shells
brew "bash"
brew "fish"

# Core tools
brew "fd"
brew "fzf"
brew "git"
brew "jq"
brew "lazygit"
brew "cpplain/tap/lnk"
brew "cpplain/tap/lorah"
brew "mas"
brew "ripgrep"
brew "sqlite"
brew "tree"
brew "tree-sitter-cli"
brew "wget"

# Editors
brew "neovim"

# Languages & version managers
brew "go"
brew "node@22"
brew "nodenv"
brew "pyenv"
brew "python"
brew "rbenv"
brew "ruby"
brew "uv"

# LSP servers
brew "bash-language-server"
brew "gopls"
brew "lua-language-server"
brew "marksman"
brew "pyright"
brew "rust-analyzer"
brew "solargraph"
brew "typescript-language-server"
brew "vscode-langservers-extracted"
brew "yaml-language-server"
brew "zls"

# Formatters & linters
brew "goimports"
brew "markdown-toc"
brew "markdownlint-cli2"
brew "prettier"
brew "shfmt"
brew "stylua"
brew "taplo"

# Casks
cask "1password"
cask "1password-cli"
cask "claude-code"
cask "docker-desktop"
cask "font-jetbrains-mono"
cask "font-sf-mono"
cask "font-symbols-only-nerd-font"
cask "ghostty"

# Mac App Store
mas "1Password for Safari", id: 1569813296

require "socket"
hostname = Socket.gethostname.downcase

if hostname.start_with? "christopher"
  cask "arq"
  cask "dropbox"
  cask "fission"
  cask "powerphotos"
  cask "sf-symbols"

  mas "Audiobook Builder", id: 1437681957
  mas "Developer", id: 640199958
  mas "GarageBand", id: 682658836
  mas "iMovie", id: 408981434
  mas "Keynote", id: 409183694
  mas "Microsoft Excel", id: 462058435
  mas "Microsoft Word", id: 462054704
  mas "Numbers", id: 409203825
  mas "Outread", id: 778846279
  mas "Pages", id: 409201541
  mas "Speedtest", id: 1153157709
  mas "Xcode", id: 497799835
else
  tap "homebrew/services"

  brew "node-build"

  cask "intellij-idea"

  mas "Okta Extension App", id: 1439967473
end
